src/test/resources/artifacts/ESB/config/soapRequests/sapbydesign/apiQueryCustomerByCommunicationData.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
    <soap:Header/>
    <soap:Body>
        <glob:CustomerByCommunicationDataQuery_sync>
            <CustomerSelectionByCommunicationData>
                <SelectionByEmailURI>
                    <InclusionExclusionCode>I</InclusionExclusionCode>
                    <IntervalBoundaryTypeCode>1</IntervalBoundaryTypeCode>
                    <LowerBoundaryEmailURI>%s(customerEmail)</LowerBoundaryEmailURI>
                </SelectionByEmailURI>
            </CustomerSelectionByCommunicationData>
            <ProcessingConditions>
                <QueryHitsUnlimitedIndicator>true</QueryHitsUnlimitedIndicator>
            </ProcessingConditions>
            <RequestedElements customerTransmissionRequestCode='2'>
                <Customer addressInformationTransmissionRequestCode='4' />
            </RequestedElements>
        </glob:CustomerByCommunicationDataQuery_sync>
    </soap:Body>
</soap:Envelope>